day1/address_book/app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.order("name ASC")
---
SELECT "contacts".* FROM "contacts"  ORDER BY name ASC

  def show
    @contact = Contact.find params[:id]
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @contact = Contact.find params[:id]
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 0]]

  def destroy
    Contact.find(params[:id]).destroy
---
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 13]]
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 13]]

  def search
    @search = params[:search]
    @contacts_search = Contact.where("name LIKE ?", "#{@search}%")
---
SELECT "contacts".* FROM "contacts" WHERE (name LIKE '@search%')

  def create
    @contact = Contact.new(contact_params)
    if @contact.valid?
      @contact.save
---
INSERT INTO "contacts" ("name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "tarda"], ["address", "tarda"], ["created_at", "2015-07-07 12:30:03.581512"], ["updated_at", "2015-07-07 12:30:03.581512"]]

  def update
    @contact = Contact.find_by(id: params[:id])
    if @contact.update_attributes(contact_params)
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "contacts" SET "phone_number" = ?, "email" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["phone_number", "34563456"], ["email", "pol@poli.com"], ["updated_at", "2015-07-07 13:18:06.157536"], ["id", 6]]

  def index_favourites
    @favourites = Contact.where(favourite: true)
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."favourite" = ?  [["favourite", "t"]]

  def favourite
    contact = Contact.find(params[:id])
    contact.update_attribute(:favourite, true)
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 32]]
UPDATE "contacts" SET "favourite" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["favourite", "t"], ["updated_at", "2015-07-07 13:10:37.108207"], ["id", 31]]